Tekla Open API Reference for Tekla Structures 2025
MarkBaseAttributes Properties
The MarkBase.MarkBaseAttributes type exposes the following members.
Properties
Name | Description
Angle
 The actual angle of the mark, in degrees. Can differ from the rotation angle set by the user for marks, e.g. 45-degree column marks in GA drawings or when placing mark along part edges.
ArrowHead
 The arrowhead of the leader line(s).
CustomPresentation
 Custom presentation GUID to be applied to the object type
Frame
 The frame attributes of the mark's labels.
PlacingAttributes
 The placing attributes that the object should use. Using these you can specify whether the object is automatically arranged in the drawing or not.
PreferredPlacing
 The type of placing the object should use. See the preferred placing types for different types of placing.
RotationAngle
 The mark rotation angle set by the user. Unit is degrees.
TextAlignment
 The mark text alignment.
TransparentBackground
 The mark text background transparency. (transparent/opaque)
Top
See Also
Reference
MarkBase.MarkBaseAttributes Class
Tekla.Structures.Drawing Namespace